_posts/linux/2016-06-06-using-emacs.html
---
layout: post
title: GNU Emacs
author: zrg
comments: false
description: Emacs, 快捷键, 主题, ...  
categories: 
- Software
tags:
- Emacs
photos:
---

<div id="outline-container-org2db0978" class="outline-2">
<h2 id="org2db0978">快捷键一览</h2>
<div class="outline-text-2" id="text-org2db0978">
</div>
<div id="outline-container-orgeefed3f" class="outline-3">
<h3 id="orgeefed3f">在命令行中打开Emacs</h3>
<div class="outline-text-3" id="text-orgeefed3f">
<pre class="example">
$ emacs -nw filename

</pre>
</div>
</div>
<div id="outline-container-orgd2c9631" class="outline-3">
<h3 id="orgd2c9631">Don't know how to use emacs?</h3>
<div class="outline-text-3" id="text-orgd2c9631">
<pre class="example">
C表示Ctrl，M表示Alt

</pre>
</div>
<div id="outline-container-org9fd82d4" class="outline-4">
<h4 id="org9fd82d4">缺省Emacs按键前缀</h4>
<div class="outline-text-4" id="text-org9fd82d4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">按键前缀</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-c</td>
<td class="org-left">当前编辑模式特有的命令</td>
</tr>

<tr>
<td class="org-left">C-x</td>
<td class="org-left">文件和缓冲区命令</td>
</tr>

<tr>
<td class="org-left">C-h</td>
<td class="org-left">帮助命令</td>
</tr>

<tr>
<td class="org-left">M-x</td>
<td class="org-left">函数名称</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org2572c88" class="outline-4">
<h4 id="org2572c88">常用的快捷键</h4>
<div class="outline-text-4" id="text-org2572c88">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x  C-c</td>
<td class="org-left">退出</td>
<td class="org-left">C-g</td>
<td class="org-left">退出一个正在运行的命令</td>
</tr>

<tr>
<td class="org-left">C-v</td>
<td class="org-left">查看下一屏</td>
<td class="org-left">M-v</td>
<td class="org-left">查看上一屏</td>
</tr>

<tr>
<td class="org-left">C-l</td>
<td class="org-left">重绘屏幕，并将光标所在行置于屏幕的中央</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-f</td>
<td class="org-left">向右移（forward,前进）</td>
<td class="org-left">C-b</td>
<td class="org-left">向左移（backward，回退）</td>
</tr>

<tr>
<td class="org-left">C-p</td>
<td class="org-left">上一行（previous）</td>
<td class="org-left">C-n</td>
<td class="org-left">下一行（next）</td>
</tr>

<tr>
<td class="org-left">M-f</td>
<td class="org-left">向右移（以单词为一个单位）</td>
<td class="org-left">M-b</td>
<td class="org-left">向左移（以单词为一个单位）</td>
</tr>

<tr>
<td class="org-left">M-&lt;</td>
<td class="org-left">移动到所有文字最开头</td>
<td class="org-left">M-&gt;</td>
<td class="org-left">移动到所有文字的最末尾</td>
</tr>

<tr>
<td class="org-left">C-a</td>
<td class="org-left">移动到行首</td>
<td class="org-left">C-e</td>
<td class="org-left">移动到行尾</td>
</tr>

<tr>
<td class="org-left">M-a</td>
<td class="org-left">移动到句首</td>
<td class="org-left">M-e</td>
<td class="org-left">移动到句尾</td>
</tr>

<tr>
<td class="org-left">C-k</td>
<td class="org-left">删除光标后的内容</td>
<td class="org-left">C-y</td>
<td class="org-left">粘贴</td>
</tr>

<tr>
<td class="org-left">C-/</td>
<td class="org-left">撤销</td>
<td class="org-left">C-x C-u</td>
<td class="org-left">撤销</td>
</tr>

<tr>
<td class="org-left">C-d</td>
<td class="org-left">删除光标后的字符</td>
<td class="org-left">M-w</td>
<td class="org-left">复制</td>
</tr>

<tr>
<td class="org-left">C-SPACE</td>
<td class="org-left">选择内容模式</td>
<td class="org-left">C-w</td>
<td class="org-left">剪切</td>
</tr>

<tr>
<td class="org-left">C-x C-f</td>
<td class="org-left">新建/打开文件</td>
<td class="org-left">C-x C-s</td>
<td class="org-left">保存</td>
</tr>

<tr>
<td class="org-left">C-x 2</td>
<td class="org-left">分屏</td>
<td class="org-left">C-x 0</td>
<td class="org-left">切换到窗口1</td>
</tr>

<tr>
<td class="org-left">C-x o</td>
<td class="org-left">切换窗口</td>
<td class="org-left">C-h t</td>
<td class="org-left">查看帮助</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf453c58" class="outline-4">
<h4 id="orgf453c58">基本文件操作</h4>
<div class="outline-text-4" id="text-orgf453c58">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x C-f</td>
<td class="org-left">打开/新建文件</td>
</tr>

<tr>
<td class="org-left">C-x C-s</td>
<td class="org-left">保存</td>
</tr>

<tr>
<td class="org-left">C-x C-w</td>
<td class="org-left">另存为</td>
</tr>

<tr>
<td class="org-left">C-x C-v</td>
<td class="org-left">关闭当前缓冲区文件，打开新文件</td>
</tr>

<tr>
<td class="org-left">C-x i</td>
<td class="org-left">在当前光标位置插入文件</td>
</tr>

<tr>
<td class="org-left">C-x b</td>
<td class="org-left">新建/切换缓存区</td>
</tr>

<tr>
<td class="org-left">C-x C-b</td>
<td class="org-left">显示缓存区列表</td>
</tr>

<tr>
<td class="org-left">C-x k</td>
<td class="org-left">关闭当前缓存区</td>
</tr>

<tr>
<td class="org-left">C-x C-c</td>
<td class="org-left">退出emacs.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org550de7b" class="outline-4">
<h4 id="org550de7b">光标移动</h4>
<div class="outline-text-4" id="text-org550de7b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-f</td>
<td class="org-left">光标向后移动</td>
</tr>

<tr>
<td class="org-left">C-b</td>
<td class="org-left">光标向前移动</td>
</tr>

<tr>
<td class="org-left">C-p</td>
<td class="org-left">上一行</td>
</tr>

<tr>
<td class="org-left">C-n</td>
<td class="org-left">下一行</td>
</tr>

<tr>
<td class="org-left">M-f</td>
<td class="org-left">光标移动到单词尾部</td>
</tr>

<tr>
<td class="org-left">M-b</td>
<td class="org-left">光标移动到单词头部</td>
</tr>

<tr>
<td class="org-left">C-a</td>
<td class="org-left">行首</td>
</tr>

<tr>
<td class="org-left">C-e</td>
<td class="org-left">行尾</td>
</tr>

<tr>
<td class="org-left">C-v</td>
<td class="org-left">向下翻页</td>
</tr>

<tr>
<td class="org-left">M-v</td>
<td class="org-left">向上翻页</td>
</tr>

<tr>
<td class="org-left">M-&lt;</td>
<td class="org-left">到文件开头</td>
</tr>

<tr>
<td class="org-left">M-&gt;</td>
<td class="org-left">到文件结尾</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgab4a8c7" class="outline-4">
<h4 id="orgab4a8c7">文本编辑</h4>
<div class="outline-text-4" id="text-orgab4a8c7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">M-n/C-u n</td>
<td class="org-left">重复执行后一个命令n次</td>
</tr>

<tr>
<td class="org-left">C-d</td>
<td class="org-left">删除后一个字符</td>
</tr>

<tr>
<td class="org-left">M-d</td>
<td class="org-left">删除前一个字符</td>
</tr>

<tr>
<td class="org-left">Del</td>
<td class="org-left">删除前一个字符</td>
</tr>

<tr>
<td class="org-left">M-Del</td>
<td class="org-left">删除前一个单词</td>
</tr>

<tr>
<td class="org-left">C-k</td>
<td class="org-left">移除一行</td>
</tr>

<tr>
<td class="org-left">C-@</td>
<td class="org-left">设定标志位(主要是为了粘贴剪切以及删除使用)</td>
</tr>

<tr>
<td class="org-left">C-w</td>
<td class="org-left">移除标记区域的内容（剪切）</td>
</tr>

<tr>
<td class="org-left">M-w</td>
<td class="org-left">复制标记区域的内容（复制）</td>
</tr>

<tr>
<td class="org-left">C-y</td>
<td class="org-left">粘贴</td>
</tr>

<tr>
<td class="org-left">M-y</td>
<td class="org-left">召回更早的内容 (在kill缓冲区内循环)</td>
</tr>

<tr>
<td class="org-left">C-t</td>
<td class="org-left">交换两个字符的位置</td>
</tr>

<tr>
<td class="org-left">M-t</td>
<td class="org-left">交换两个单词的位置</td>
</tr>

<tr>
<td class="org-left">C-x C-t</td>
<td class="org-left">交换两行的位置</td>
</tr>

<tr>
<td class="org-left">M-u</td>
<td class="org-left">使从光标位置到单词结尾处的字母变成大写</td>
</tr>

<tr>
<td class="org-left">M-l</td>
<td class="org-left">与M-u相反</td>
</tr>

<tr>
<td class="org-left">M-c</td>
<td class="org-left">使从光标位置开始的单词的首字母变为大写</td>
</tr>

<tr>
<td class="org-left">M-x mark-whole-buffer or C-x h, M-x indent-region or C-M-\</td>
<td class="org-left">选中整个文件，然后格式化</td>
</tr>

<tr>
<td class="org-left">M-x mark-defun or C-M-h, M-x indent-region or C-M-\</td>
<td class="org-left">选中函数，格式化</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga65dee2" class="outline-4">
<h4 id="orga65dee2">搜索</h4>
<div class="outline-text-4" id="text-orga65dee2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-s</td>
<td class="org-left">向前搜索</td>
</tr>

<tr>
<td class="org-left">C-r</td>
<td class="org-left">向前搜索</td>
</tr>

<tr>
<td class="org-left">M-%</td>
<td class="org-left">查找及替换:首先按下快捷键，输入要替换的词，RET，然后输入要替换的词，RET</td>
</tr>
</tbody>
</table>
</div>
</div>
