_orgs/_posts/linux/2016-06-06-using-emacs.org
*** 窗口命令
| 快捷键 | 描述                           |
|--------+--------------------------------|
| C-x 2  | 水平分割窗格                   |
| C-x 3  | 垂直分割窗格                   |
| C-x o  | 切换至其他窗格                 |
| C-x 0  | 关闭窗格                       |
| C-x 1  | 关闭除了光标所在窗格外所有窗格 |
*** 帮助
| C-h m    | 查看当前模式                   |
| C-h c    | 显示快捷键绑定的命令           |
| C-h k    | 显示快捷键绑定的命令和它的作用 |
| C-h f    | 显示函数的功能                 |
| C-h b    | 显示当前缓冲区所有可用的快捷键 |
| C-h t    | 打开emacs教程                  |
| M-x quit | 退出help                       |
* 自定义Emacs
** Emacs基础定制
: 打开.emacs文件
#+BEGIN_SRC emacs-lisp
;; 显示行列号
(setq column-number-mode t)
(setq line-number-mode t)
;; 设置标题栏
(setq frame-title-format "Welcome to Emacs world! ")
;; 禁用菜单栏；F10开启菜单栏
(menu-bar-mode nil)
;; 取消工具栏
(tool-bar-mode nil)
;; 取消滚动栏
(set-scroll-bar-mode nil)
;; 直接打开和显示图片
(setq auto-image-file-mode t)
;; 显示时间
(display-time-mode t)
;; 24小时制
(setq display-time-24hr-format t)
;; 设置F11最大化
(global-set-key [f11] 'maximized)
(defun maximized ()
(interactive)
(x-send-client-message nil 0 nil "_NET_WM_STATE" 32 '(2 "_NET_WM_STATE_MAXIMIZED_HORZ" 0)) (x-send-client-message nil 0 nil "_NET_WM_STATE" 32 '(2 "_NET_WM_STATE_MAXIMIZED_VERT" 0))
 )
#+END_SRC
: 快速使用设置命令: M-x eval-buffer
** 自定义高级配置
: thems, log manage, ...
*** Emacs 主题
: .el
: ~/.emacs.d/

#+BEGIN_SRC
//添加到.emacs文件
(add-to-list 'load-path "~/.emacs.d/")
(require 'pluginname)
#+END_SRC
* org-mode
** Keyboard
| 快捷键                                     | 描述                                                    |
|--------------------------------------------+---------------------------------------------------------|
| TAB  (org-cycle)                           | Cycle visibility. 循环切换光标所在大纲的状态            |
| RET                                        | enter,Select this location.                             |
| C-c C-n (org-next-visible-heading)         | Next heading.                                           |
| C-c C-p (org-previous-visible-heading)     | Previous heading.                                       |
| C-c C-f (org-forward-same-level)           | Next heading same level.                                |
| C-c C-b (org-backward-same-level)          | Previous heading same level.                            |
| C-c C-u (outline-up-heading)               | Backward to higher level heading.                       |
| C-c C-j                                    | 切换到大纲浏览状态                                      |
| M-RET (org-meta-return)                    | Insert a new heading, item or row.  插入一个同级标题    |
| C-RET (org-insert-heading-respect-content) | Insert a new heading at the end of the current subtree. |
| M-LEFT/RIGHT                               | 将当前标题升/降级                                       |
| M-S-LEFT/RIGHT                             | 将子树升/降级                                           |
| M-S-UP/DOWN                                | 将子树上/下移                                           |
** Working with Source Code
*** Structure of Code Blocks
 : Code block syntax described.
 #+NAME: Structure of Code Blocks
 #+BEGIN_SRC emacs-lisp
 : #+NAME: <name>
 : #+BEGIN_SRC <language> <switches> <header arguments>
 :   <body>
 : #+END_SRC
 #+END_SRC
 : more info.：https://orgmode.org/org.html#Structure-of-Code-Blocks
*** Using Header Arguments
 : Different ways to set header arguments.

 : 1. System-wide header arguments
 : 2. Header arguments in Org mode properties
 : 3. Code block specific header arguments
 : 4. Header arguments in function calls

 : more info.：https://orgmode.org/org.html#Using-Header-Arguments
*** Environment of a Code Block
 : Arguments, sessions, working directory...

 : 1. Passing arguments
 : 2. Using sessions
 : 3. Choosing a working directory
 : 4. Inserting headers and footers

 : more info.：https://orgmode.org/org.html#Environment-of-a-Code-Block
*** Evaluating Code Blocks
 : Place results of evaluation in the Org buffer.

 : 1. How to evaluate source code
 : 2. Limit code block evaluation
 : 3. Cache results of evaluation

 : more info.：https://orgmode.org/org.html#Evaluating-Code-Blocks
*** Results of Evaluation
 : Choosing a results type, post-processing...

 : 1. collection
 : r how the results should be collected from the code block;
 : 2. type
 : For which type of result the code block will return; affects how Org processes and inserts results in the Org buffer;
 : 3. format
 : For the result; affects how Org processes and inserts results in the Org buffer;
 : 4. handling
 : For processing results after evaluation of the code block;

 : more info.：https://orgmode.org/org.html#Results-of-Evaluation
*** Exporting Code Blocks
 : Export contents and/or results.

 : 1. ‘code’
 : The default. The body of code is included into the exported file. Example: ‘:exports code’.
 : 2. ‘results’
 : The results of evaluation of the code is included in the exported file. Example: ‘:exports results’.
 : 3. ‘both’
 : Both the code and results of evaluation are included in the exported file. Example: ‘:exports both’.
 : 4. ‘none
 : Neither the code nor the results of evaluation is included in the exported file. Whether the code is evaluated at all depends on other options. Example: ‘:exports none’.

 : more info.：https://orgmode.org/org.html#Exporting-Code-Blocks
