_posts/linux/2016-06-06-using-emacs.html
<div id="outline-container-org844c759" class="outline-4">
<h4 id="org844c759">窗口命令</h4>
<div class="outline-text-4" id="text-org844c759">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-x 2</td>
<td class="org-left">水平分割窗格</td>
</tr>

<tr>
<td class="org-left">C-x 3</td>
<td class="org-left">垂直分割窗格</td>
</tr>

<tr>
<td class="org-left">C-x o</td>
<td class="org-left">切换至其他窗格</td>
</tr>

<tr>
<td class="org-left">C-x 0</td>
<td class="org-left">关闭窗格</td>
</tr>

<tr>
<td class="org-left">C-x 1</td>
<td class="org-left">关闭除了光标所在窗格外所有窗格</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org98e9693" class="outline-4">
<h4 id="org98e9693">帮助</h4>
<div class="outline-text-4" id="text-org98e9693">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">C-h m</td>
<td class="org-left">查看当前模式</td>
</tr>

<tr>
<td class="org-left">C-h c</td>
<td class="org-left">显示快捷键绑定的命令</td>
</tr>

<tr>
<td class="org-left">C-h k</td>
<td class="org-left">显示快捷键绑定的命令和它的作用</td>
</tr>

<tr>
<td class="org-left">C-h f</td>
<td class="org-left">显示函数的功能</td>
</tr>

<tr>
<td class="org-left">C-h b</td>
<td class="org-left">显示当前缓冲区所有可用的快捷键</td>
</tr>

<tr>
<td class="org-left">C-h t</td>
<td class="org-left">打开emacs教程</td>
</tr>

<tr>
<td class="org-left">M-x quit</td>
<td class="org-left">退出help</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="outline-container-orgac0339f" class="outline-2">
<h2 id="orgac0339f">自定义Emacs</h2>
<div class="outline-text-2" id="text-orgac0339f">
</div>
<div id="outline-container-org659c123" class="outline-3">
<h3 id="org659c123">Emacs基础定制</h3>
<div class="outline-text-3" id="text-org659c123">
<pre class="example">
打开.emacs文件

</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #b22222;">;; </span><span style="color: #b22222;">&#26174;&#31034;&#34892;&#21015;&#21495;</span>
(<span style="color: #a020f0;">setq</span> column-number-mode t)
(<span style="color: #a020f0;">setq</span> line-number-mode t)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#35774;&#32622;&#26631;&#39064;&#26639;</span>
(<span style="color: #a020f0;">setq</span> frame-title-format <span style="color: #8b2252;">"Welcome to Emacs world! "</span>)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#31105;&#29992;&#33756;&#21333;&#26639;&#65307;F10&#24320;&#21551;&#33756;&#21333;&#26639;</span>
(menu-bar-mode nil)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#21462;&#28040;&#24037;&#20855;&#26639;</span>
(tool-bar-mode nil)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#21462;&#28040;&#28378;&#21160;&#26639;</span>
(set-scroll-bar-mode nil)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#30452;&#25509;&#25171;&#24320;&#21644;&#26174;&#31034;&#22270;&#29255;</span>
(<span style="color: #a020f0;">setq</span> auto-image-file-mode t)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#26174;&#31034;&#26102;&#38388;</span>
(display-time-mode t)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">24&#23567;&#26102;&#21046;</span>
(<span style="color: #a020f0;">setq</span> display-time-24hr-format t)
<span style="color: #b22222;">;; </span><span style="color: #b22222;">&#35774;&#32622;F11&#26368;&#22823;&#21270;</span>
(global-set-key [f11] 'maximized)
(<span style="color: #a020f0;">defun</span> <span style="color: #0000ff;">maximized</span> ()
(<span style="color: #a020f0;">interactive</span>)
(x-send-client-message nil 0 nil <span style="color: #8b2252;">"_NET_WM_STATE"</span> 32 '(2 <span style="color: #8b2252;">"_NET_WM_STATE_MAXIMIZED_HORZ"</span> 0)) (x-send-client-message nil 0 nil <span style="color: #8b2252;">"_NET_WM_STATE"</span> 32 '(2 <span style="color: #8b2252;">"_NET_WM_STATE_MAXIMIZED_VERT"</span> 0))
 )
</pre>
</div>
<pre class="example">
快速使用设置命令: M-x eval-buffer

</pre>
</div>
</div>
<div id="outline-container-org8b9499f" class="outline-3">
<h3 id="org8b9499f">自定义高级配置</h3>
<div class="outline-text-3" id="text-org8b9499f">
<pre class="example">
thems, log manage, ...

</pre>
</div>
<div id="outline-container-org5a6f9c3" class="outline-4">
<h4 id="org5a6f9c3">Emacs 主题</h4>
<div class="outline-text-4" id="text-org5a6f9c3">
<pre class="example">
.el
~/.emacs.d/

</pre>

<pre class="example">
//添加到.emacs文件
(add-to-list 'load-path "~/.emacs.d/")
(require 'pluginname)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5cc13bf" class="outline-2">
<h2 id="org5cc13bf">org-mode</h2>
<div class="outline-text-2" id="text-org5cc13bf">
</div>
<div id="outline-container-org224b2b3" class="outline-3">
<h3 id="org224b2b3">Keyboard</h3>
<div class="outline-text-3" id="text-org224b2b3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">TAB  (org-cycle)</td>
<td class="org-left">Cycle visibility. 循环切换光标所在大纲的状态</td>
</tr>

<tr>
<td class="org-left">RET</td>
<td class="org-left">enter,Select this location.</td>
</tr>

<tr>
<td class="org-left">C-c C-n (org-next-visible-heading)</td>
<td class="org-left">Next heading.</td>
</tr>

<tr>
<td class="org-left">C-c C-p (org-previous-visible-heading)</td>
<td class="org-left">Previous heading.</td>
</tr>

<tr>
<td class="org-left">C-c C-f (org-forward-same-level)</td>
<td class="org-left">Next heading same level.</td>
</tr>

<tr>
<td class="org-left">C-c C-b (org-backward-same-level)</td>
<td class="org-left">Previous heading same level.</td>
</tr>

<tr>
<td class="org-left">C-c C-u (outline-up-heading)</td>
<td class="org-left">Backward to higher level heading.</td>
</tr>

<tr>
<td class="org-left">C-c C-j</td>
<td class="org-left">切换到大纲浏览状态</td>
</tr>

<tr>
<td class="org-left">M-RET (org-meta-return)</td>
<td class="org-left">Insert a new heading, item or row.  插入一个同级标题</td>
</tr>

<tr>
<td class="org-left">C-RET (org-insert-heading-respect-content)</td>
<td class="org-left">Insert a new heading at the end of the current subtree.</td>
</tr>

<tr>
<td class="org-left">M-LEFT/RIGHT</td>
<td class="org-left">将当前标题升/降级</td>
</tr>

<tr>
<td class="org-left">M-S-LEFT/RIGHT</td>
<td class="org-left">将子树升/降级</td>
</tr>

<tr>
<td class="org-left">M-S-UP/DOWN</td>
<td class="org-left">将子树上/下移</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgfd7c030" class="outline-3">
<h3 id="orgfd7c030">Working with Source Code</h3>
<div class="outline-text-3" id="text-orgfd7c030">
</div>
<div id="outline-container-org55ac748" class="outline-4">
<h4 id="org55ac748">Structure of Code Blocks</h4>
<div class="outline-text-4" id="text-org55ac748">
<pre class="example">
Code block syntax described.

</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org427a9d9">: #+NAME: &lt;name&gt;
: #+BEGIN_SRC &lt;language&gt; &lt;switches&gt; &lt;header arguments&gt;
:   &lt;body&gt;
: #+END_SRC
</pre>
</div>
<pre class="example">
more info.：https://orgmode.org/org.html#Structure-of-Code-Blocks

</pre>
</div>
</div>
<div id="outline-container-org67fdeb0" class="outline-4">
<h4 id="org67fdeb0">Using Header Arguments</h4>
<div class="outline-text-4" id="text-org67fdeb0">
<pre class="example">
Different ways to set header arguments.

</pre>

<pre class="example">
1. System-wide header arguments
2. Header arguments in Org mode properties
3. Code block specific header arguments
4. Header arguments in function calls

</pre>

<pre class="example">
more info.：https://orgmode.org/org.html#Using-Header-Arguments

</pre>
</div>
</div>
<div id="outline-container-org51a51b2" class="outline-4">
<h4 id="org51a51b2">Environment of a Code Block</h4>
<div class="outline-text-4" id="text-org51a51b2">
<pre class="example">
Arguments, sessions, working directory...

</pre>

<pre class="example">
1. Passing arguments
2. Using sessions
3. Choosing a working directory
4. Inserting headers and footers

</pre>

<pre class="example">
more info.：https://orgmode.org/org.html#Environment-of-a-Code-Block

</pre>
</div>
</div>
<div id="outline-container-org8464353" class="outline-4">
<h4 id="org8464353">Evaluating Code Blocks</h4>
<div class="outline-text-4" id="text-org8464353">
<pre class="example">
Place results of evaluation in the Org buffer.

</pre>

<pre class="example">
1. How to evaluate source code
2. Limit code block evaluation
3. Cache results of evaluation

</pre>

<pre class="example">
more info.：https://orgmode.org/org.html#Evaluating-Code-Blocks

</pre>
</div>
</div>
<div id="outline-container-org9bde2bc" class="outline-4">
<h4 id="org9bde2bc">Results of Evaluation</h4>
<div class="outline-text-4" id="text-org9bde2bc">
<pre class="example">
Choosing a results type, post-processing...

</pre>

<pre class="example">
1. collection
r how the results should be collected from the code block;
2. type
For which type of result the code block will return; affects how Org processes and inserts results in the Org buffer;
3. format
For the result; affects how Org processes and inserts results in the Org buffer;
4. handling
For processing results after evaluation of the code block;

</pre>

<pre class="example">
more info.：https://orgmode.org/org.html#Results-of-Evaluation

</pre>
</div>
</div>
<div id="outline-container-orgcfdd1ff" class="outline-4">
<h4 id="orgcfdd1ff">Exporting Code Blocks</h4>
<div class="outline-text-4" id="text-orgcfdd1ff">
<pre class="example">
Export contents and/or results.

</pre>

<pre class="example">
1. ‘code’
The default. The body of code is included into the exported file. Example: ‘:exports code’.
2. ‘results’
The results of evaluation of the code is included in the exported file. Example: ‘:exports results’.
3. ‘both’
Both the code and results of evaluation are included in the exported file. Example: ‘:exports both’.
4. ‘none
Neither the code nor the results of evaluation is included in the exported file. Whether the code is evaluated at all depends on other options. Example: ‘:exports none’.

</pre>

<pre class="example">
more info.：https://orgmode.org/org.html#Exporting-Code-Blocks

</pre>
</div>
</div>
