_orgs/_posts/linux/2016-06-06-using-emacs.org
*** Extracting Source Code
 : Create pure source code files.

 : 1. Header arguments
 : 2. Functions
 : 3. Hooks
 : 4. Jumping between code and Org

 : more info.：https://orgmode.org/org.html#Extracting-Source-Code
*** Languages
 : List of supported code block languages.

 : more info.：https://orgmode.org/org.html#Languages
*** Editing Source Code
 : Language major-mode editing.

: more info.：https://orgmode.org/org.html#Editing-Source-Code
*** Noweb Reference Syntax
 : Literate programming in Org mode.

 : more info.：https://orgmode.org/org.html#Noweb-Reference-Syntax
*** Library of Babel
 : Use and contribute to a library of useful code blocks.

 : more info.：https://orgmode.org/org.html#Library-of-Babel
*** Key bindings and Useful Functions
 : Work quickly with code blocks.

 : more info.：https://orgmode.org/org.html#Key-bindings-and-Useful-Functions
*** Batch Execution 
 : Call functions from the command line.

 : more info.：https://orgmode.org/org.html#Batch-Execution
* 问题解决
** emacs不能输入中文
: //编辑~/.bashrc文件，加入如下内容：
: $ vim ~/.bashrc
: LC_CTYPE="zh_CN.utf8"

: //编辑/etc/environment文件，加入如下内容：
: $ sudo vim /etc/environment
: LC_CTYPE="zh_CN.utf8"
* 参考资料
+ [[http://www.cnblogs.com/holbrook/archive/2012/04/12/2444992.html][org-mode: 最好的文档编辑利器]]

