_posts/linux/2016-06-06-using-emacs.html
<div id="outline-container-org2dc3d49" class="outline-4">
<h4 id="org2dc3d49">Extracting Source Code</h4>
<div class="outline-text-4" id="text-org2dc3d49">
<pre class="example">
Create pure source code files.

</pre>

<pre class="example">
1. Header arguments
2. Functions
3. Hooks
4. Jumping between code and Org

</pre>

<pre class="example">
more info.：https://orgmode.org/org.html#Extracting-Source-Code

</pre>
</div>
</div>
<div id="outline-container-orgba0204a" class="outline-4">
<h4 id="orgba0204a">Languages</h4>
<div class="outline-text-4" id="text-orgba0204a">
<pre class="example">
List of supported code block languages.

</pre>

<pre class="example">
more info.：https://orgmode.org/org.html#Languages

</pre>
</div>
</div>
<div id="outline-container-org7dec9ec" class="outline-4">
<h4 id="org7dec9ec">Editing Source Code</h4>
<div class="outline-text-4" id="text-org7dec9ec">
<pre class="example">
Language major-mode editing.

</pre>

<pre class="example">
more info.：https://orgmode.org/org.html#Editing-Source-Code

</pre>
</div>
</div>
<div id="outline-container-orge16e2a4" class="outline-4">
<h4 id="orge16e2a4">Noweb Reference Syntax</h4>
<div class="outline-text-4" id="text-orge16e2a4">
<pre class="example">
Literate programming in Org mode.

</pre>

<pre class="example">
more info.：https://orgmode.org/org.html#Noweb-Reference-Syntax

</pre>
</div>
</div>
<div id="outline-container-org40141a8" class="outline-4">
<h4 id="org40141a8">Library of Babel</h4>
<div class="outline-text-4" id="text-org40141a8">
<pre class="example">
Use and contribute to a library of useful code blocks.

</pre>

<pre class="example">
more info.：https://orgmode.org/org.html#Library-of-Babel

</pre>
</div>
</div>
<div id="outline-container-orgda8173b" class="outline-4">
<h4 id="orgda8173b">Key bindings and Useful Functions</h4>
<div class="outline-text-4" id="text-orgda8173b">
<pre class="example">
Work quickly with code blocks.

</pre>

<pre class="example">
more info.：https://orgmode.org/org.html#Key-bindings-and-Useful-Functions

</pre>
</div>
</div>
<div id="outline-container-org6e2e3a9" class="outline-4">
<h4 id="org6e2e3a9">Batch Execution</h4>
<div class="outline-text-4" id="text-org6e2e3a9">
<pre class="example">
Call functions from the command line.

</pre>

<pre class="example">
more info.：https://orgmode.org/org.html#Batch-Execution

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbe1cb6f" class="outline-2">
<h2 id="orgbe1cb6f">问题解决</h2>
<div class="outline-text-2" id="text-orgbe1cb6f">
</div>
<div id="outline-container-orgf9fff1c" class="outline-3">
<h3 id="orgf9fff1c">emacs不能输入中文</h3>
<div class="outline-text-3" id="text-orgf9fff1c">
<pre class="example">
//编辑~/.bashrc文件，加入如下内容：
$ vim ~/.bashrc
LC_CTYPE="zh_CN.utf8"

</pre>

<pre class="example">
//编辑/etc/environment文件，加入如下内容：
$ sudo vim /etc/environment
LC_CTYPE="zh_CN.utf8"

</pre>
</div>
</div>
</div>
<div id="outline-container-orgd20bf65" class="outline-2">
<h2 id="orgd20bf65">参考资料</h2>
<div class="outline-text-2" id="text-orgd20bf65">
<ul class="org-ul">
<li><a href="http://www.cnblogs.com/holbrook/archive/2012/04/12/2444992.html">org-mode: 最好的文档编辑利器</a></li>
</ul>
</div>
</div>
